app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.questions.any? %>
---
SELECT  1 AS one FROM "questions" WHERE "questions"."user_id" = ? LIMIT 1  [["user_id", 2]]