app/views/shared/_stats.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = ?  ORDER BY "questions"."created_at" DESC  [["user_id", 2]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 2]]
---
    <strong id="questions" class="stat">
      <%= @user.questions.count %>

SELECT COUNT(*) FROM "answers" WHERE "answers"."user_id" = ?  [["user_id", 2]]
---
    <strong id="answers" class="stat">
      <%= @user.answers.count %>