app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ?  ORDER BY "questions"."created_at" DESC LIMIT 1  [["id", 11]]
INSERT INTO "answers" ("content", "question_id", "user_id", "votes", "is_answer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["content", "asdsd"], ["question_id", 11], ["user_id", 2], ["votes", 0], ["is_answer", "f"], ["created_at", "2016-04-21 10:16:36.017371"], ["updated_at", "2016-04-21 10:16:36.017371"]]
---
  def create
  	@question = Question.find(params[:current_question])
  	@answer = @question.answers.build(answer_params)
  	@answer.user_id = params[:current_user]
  	@answer.votes = 0
  	@answer.is_answer = false
    if @answer.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ?  ORDER BY "questions"."created_at" DESC LIMIT 1  [["id", 11]]
UPDATE "answers" SET "is_answer" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["is_answer", "t"], ["updated_at", "2016-04-22 07:51:12.324383"], ["id", 4]]
---
  def update
    @answer = Answer.find(params[:id])
    @answer.question.answers.each { |a| a.update_attribute(:is_answer, false) if a.is_answer }

SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."answer_id" = ? LIMIT 1  [["user_id", 2], ["answer_id", 5]]
INSERT INTO "votes" ("user_id", "answer_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["answer_id", 5], ["value", 1], ["created_at", "2016-04-22 13:23:20.312604"], ["updated_at", "2016-04-22 13:23:20.312604"]]
UPDATE "answers" SET "votes" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["votes", 1], ["updated_at", "2016-04-22 13:23:20.317492"], ["id", 5]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 18]]
---
  def upvote
    answer = Answer.find(params[:answerid])
    user = current_user
    vote = user.votes.find_by(answer_id: answer.id)
    if(vote.nil?)
      vote = Vote.new
      vote.user_id = user.id
      vote.answer_id = answer.id
      vote.value = 1
      vote.save
      answer.update_attribute(:votes, answer.votes + 1)
      flash[:success] = "Answer upvoted!"
      redirect_to request.referrer
    else
      if(vote.value == 1)
        flash[:info] = "You have already upvoted this answer"
        redirect_to request.referrer
      else
        vote.destroy

SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."answer_id" = ? LIMIT 1  [["user_id", 2], ["answer_id", 5]]
INSERT INTO "votes" ("user_id", "answer_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["answer_id", 5], ["value", -1], ["created_at", "2016-04-22 13:24:07.105677"], ["updated_at", "2016-04-22 13:24:07.105677"]]
UPDATE "answers" SET "votes" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["votes", 0], ["updated_at", "2016-04-22 13:24:05.367359"], ["id", 5]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 17]]
---
  def downvote
    answer = Answer.find(params[:answerid])
    user = current_user
    vote = user.votes.find_by(answer_id: answer.id)
    if(vote.nil?)
      vote = Vote.new
      vote.user_id = user.id
      vote.answer_id = answer.id
      vote.value = -1
      vote.save
      answer.update_attribute(:votes, answer.votes - 1)
      flash[:success] = "Answer downvoted!"
      redirect_to request.referrer
    else
      if(vote.value == -1)
        flash[:info] = "You have already downvoted this answer"
        redirect_to request.referrer
      else
        vote.destroy