app/controllers/comments_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ?  ORDER BY "questions"."created_at" DESC LIMIT 1  [["id", 11]]
INSERT INTO "comments" ("content", "question_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "asd"], ["question_id", 11], ["user_id", 2], ["created_at", "2016-04-23 07:45:10.212185"], ["updated_at", "2016-04-23 07:45:10.212185"]]
---
  def create
  	if(params[:qa] == "1")
  	  @comment = Question.find(params[:question_id]).comments.build(comment_params)
  	  @comment.question_id = params[:question_id]
  	else
  	  @comment = Answer.find(params[:answer_id]).comments.build(comment_params)
  	  @comment.answer_id = params[:answer_id]
  	end
    @comment.user_id = current_user.id
    if @comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ?  ORDER BY "comments"."created_at" DESC LIMIT 1  [["id", 2]]
---
  def destroy
    Comment.find(params[:commentid]).destroy