app/controllers/questions_controller.rb

  def create
  	@question = current_user.questions.build(question_params)
    @question.votes = 0
    if @question.save
      flash[:success] = "Question posted!"
      redirect_to root_url
    else
      @feed_items = current_user.questions.paginate(page: params[:page])
---
INSERT INTO "questions" ("title", "content", "user_id", "votes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "as"], ["content", "asd"], ["user_id", 2], ["votes", 0], ["created_at", "2016-04-21 06:40:47.084244"], ["updated_at", "2016-04-21 06:40:47.084244"]]
SELECT  "questions".* FROM "questions" WHERE "questions"."user_id" = ?  ORDER BY "questions"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 2]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 3]]

  def show
    @question = Question.find(params[:id])
    @user = @question.user
    @answers = @question.answers.paginate(page: params[:page])
    @comments = @question.comments.paginate(page: params[:page])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ?  ORDER BY "questions"."created_at" DESC LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 11]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."question_id" = ?  ORDER BY "comments"."created_at" DESC LIMIT 30 OFFSET 0  [["question_id", 11]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."question_id" = ?  [["question_id", 11]]

  def upvote
    question = Question.find(params[:id])
    user = current_user
    vote = user.votes.find_by(question_id: question.id)
    if(vote.nil?)
      vote = Vote.new
      vote.user_id = user.id
      vote.question_id = question.id
      vote.value = 1
      vote.save
      question.update_attribute(:votes, question.votes + 1)
      flash[:success] = "Question upvoted!"
      redirect_to request.referrer
    else
      if(vote.value == 1)
        flash[:info] = "You have already upvoted this question"
        redirect_to request.referrer
      else
        vote.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ?  ORDER BY "questions"."created_at" DESC LIMIT 1  [["id", 11]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."question_id" = ? LIMIT 1  [["user_id", 2], ["question_id", 11]]
INSERT INTO "votes" ("user_id", "question_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["question_id", 11], ["value", 1], ["created_at", "2016-04-22 12:52:44.113245"], ["updated_at", "2016-04-22 12:52:44.113245"]]
UPDATE "questions" SET "votes" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["votes", 1], ["updated_at", "2016-04-22 13:00:47.415740"], ["id", 11]]
UPDATE "votes" SET "value" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["value", 1], ["updated_at", "2016-04-22 12:56:45.061895"], ["id", 1]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 6]]

  def downvote
    question = Question.find(params[:id])
    user = current_user
    vote = user.votes.find_by(question_id: question.id)
    if(vote.nil?)
      vote = Vote.new
      vote.user_id = user.id
      vote.question_id = question.id
      vote.value = -1
      vote.save
      question.update_attribute(:votes, question.votes - 1)
      flash[:success] = "Question downvoted!"
      redirect_to request.referrer
    else
      if(vote.value == -1)
        flash[:info] = "You have already downvoted this question"
        redirect_to request.referrer
      else
        vote.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ?  ORDER BY "questions"."created_at" DESC LIMIT 1  [["id", 11]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."question_id" = ? LIMIT 1  [["user_id", 2], ["question_id", 11]]
INSERT INTO "votes" ("user_id", "question_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["question_id", 11], ["value", -1], ["created_at", "2016-04-22 13:03:53.385060"], ["updated_at", "2016-04-22 13:03:53.385060"]]
UPDATE "questions" SET "votes" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["votes", 0], ["updated_at", "2016-04-22 13:00:53.435586"], ["id", 11]]
UPDATE "votes" SET "value" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["value", -1], ["updated_at", "2016-04-22 12:56:22.073286"], ["id", 1]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 4]]