app/controllers/static_pages_controller.rb

  def home
    if logged_in?
      @question  = current_user.questions.build
      @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT  "questions".* FROM "questions" WHERE (user_id = 3)  ORDER BY "questions"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 2]]