app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "questions".* FROM "questions" WHERE "questions"."user_id" = ?  ORDER BY "questions"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 3]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 3]]
---
  def show
    @user = User.find(params[:id])
    @questions = @user.questions.paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "questions".* FROM "questions" WHERE "questions"."user_id" = ?  ORDER BY "questions"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 2]]
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 2]]
---
  def questions
    @title = "Questions"
    @user  = User.find(params[:id])
    @questions = @user.questions.paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."user_id" = ?  [["user_id", 3]]
---
  def answers
    @title = "Answers"
    @user  = User.find(params[:id])
    @answers = @user.answers.paginate(page: params[:page])